//
// /
//  main.swift
//  2ndLesson1M
//
//  Created by Ruslan Sharshenov on 19/10/22.
// ТЕМА: Система контроля версий GIT. Условные операторы if, else if, switch

//3. Условные операторы if, else, elseif, switch.

//print("Введите город")
//let number = readLine()!

// > -> больше
// >= -> больше или равно
// < -> меньше
// <= -> меньше или равно
// == -> равно
// != -> не равно

// && -> и
// || -> или

//let weather = "Биш"
//
//if weather == "Биш"{
//    print("сегодня +10, завтра +17, после завтра +24")
//}


//if Int(number)! > 10 && Int(number)! < 20{
//    print("\(number) больше 10 и меньше 20")
//}else if Int(number)! == 50{
//    print("Ваше число - 50!")
//}else{
//   print("Введите другое число")
//}

//let trueOrFalse: Bool = Int(number)! > 10 // true
//print(trueOrFalse)

//if num > 0 || num2 > 0 || num3 > 0{
//    print("есть положительные числа")
//}
//
//if num == 0 || num2 == 0 || num3 == 0{
//    print("есть число 0")
//}
//
//if num < 0 || num2 < 0 || num3 < 0{
//    print("есть отрицательные числа")
//}

//Д/З №2 Система контроля версий GIT. Условные операторы if, else if, switch
//
//№1. Используя функции, условные операторы составить следующую программу прогноза погоды:
//
//При вводе одного из городов в readLine (Бишкек, Чолпон-Ата, Талас, Ош, Джалал-Абад, Нарын, Баткен) выводить в итоге данные о погоде на ближайшие 3 дня в указанном городе
//
//№2. Используя условные операторы и функции создать программу, которая после ввода 5 наименований продуктов через readLine будет считать итоговую стоимость покупок (со скидкой в 5%)
//
//В итоге должно быть так: (например) Ваши товары:
//Кола - 50с
//Кефир - 65с
//Молоко - 40с
//Хлеб - 20с
//Салат - 100с
//
//275с + скидка 13,75c
//Итого: 261,25с
//
//№3. Доработать калькулятор с прошлого урока с помощью условных операторов и соединить всё с readLine (например сначала спрашиваете число, после чего “Какое действие совершить?”, затем второе число и т.д ) (максимум доступно 5 действий). И в итоге выдать итоговый результат используя заранее подготовленные функции для вычислений

//var a = "ABC" + " " + "ABC"
//
//print(a)
//
//a += "BCA"
//
//print(a)

//5
//4
//+
//9. считаем дальше?(да/нет)
//5
//-
//4



